# Pandas

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html
* Уэс Маккини. Python и анализ данных

## Задачи для совместного разбора

In [1]:
import pandas as pd
import numpy as np

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [2]:
df_sp500 = pd.read_csv('sp500hst.txt',header= None)

In [3]:
new_columns = ['Date','Ticker','Open','High','Low','Close','Volume']
old_columns = range(7)

In [4]:
columns = dict(zip(old_columns, new_columns))

In [5]:
df_sp500 =df_sp500.rename(columns = columns)

In [6]:
df_sp500

            Date Ticker   Open     High     Low  Close  Volume
0       20090821      A  25.60  25.6100  25.220  25.55   34758
1       20090824      A  25.64  25.7400  25.330  25.50   22247
2       20090825      A  25.50  25.7000  25.225  25.34   30891
3       20090826      A  25.32  25.6425  25.145  25.48   33334
4       20090827      A  25.50  25.5700  25.230  25.54   70176
...          ...    ...    ...      ...     ...    ...     ...
122569  20100813    ZMH  51.72  51.9000  51.380  51.44   14561
122570  20100816    ZMH  51.13  51.4700  50.600  51.00   13489
122571  20100817    ZMH  51.14  51.6000  50.890  51.21   20498
122572  20100819    ZMH  51.63  51.6300  50.170  50.22   18259
122573  20100820    ZMH  50.03  50.5500  49.480  49.82   17792

[122574 rows x 7 columns]

2. Рассчитайте среднее значение показателей для каждого из столбцов c номерами 3-6.

In [16]:
np.mean(df_sp500[['Open','High','Low','Open']])

Open    42.595458
High    43.102243
Low     42.054464
Open    42.595458
dtype: float64

3. Добавьте столбец, содержащий только число месяца, к которому относится дата.

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

## Лабораторная работа №2

### Базовые операции с `DataFrame`

1.1 В файлах `recipes_sample.csv` и `reviews_sample.csv` находится информация об рецептах блюд и отзывах на эти рецепты соответственно. Загрузите данные из файлов в виде `pd.DataFrame` с названиями `recipes` и `reviews`. Обратите внимание на корректное считывание столбца с индексами в таблице `reviews` (безымянный столбец).

In [78]:
df_recipes = pd.read_csv('recipes_sample.csv')
df_reviews = pd.read_csv('reviews_sample.csv')

In [19]:
df_recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [79]:
df_reviews

,Unnamed: 0,user_id,recipe_id,date,rating,review
0,370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
2,187037,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
3,706134,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
4,312179,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...
...,...,...,...,...,...,...
126691,1013457,1270706,335534,2009-05-17,4,This recipe was great! I made it last night. I...
126692,158736,2282344,8701,2012-06-03,0,This recipe is outstanding. I followed the rec...
126693,1059834,689540,222001,2008-04-08,5,"Well, we were not a crowd but it was a fabulou..."
126694,453285,2000242659,354979,2015-06-02,5,I have been a steak eater and dedicated BBQ gr...
126695,691207,463435,415599,2010-09-30,5,Wonderful and simple to prepare seasoning blen...

1.2 Для каждой из таблиц выведите основные параметры:
* количество точек данных (строк);
* количество столбцов;
* тип данных каждого столбца.

1.3 Исследуйте, в каких столбцах таблиц содержатся пропуски. Посчитайте долю строк, содержащих пропуски, в отношении к общему количеству строк.

1.4 Рассчитайте среднее значение для каждого из числовых столбцов (где это имеет смысл).

1.5 Создайте серию из 10 случайных названий рецептов.

1.6 Измените индекс в таблице `reviews`, пронумеровав строки, начиная с нуля.

1.7 Выведите информацию о рецептах, время выполнения которых не больше 20 минут и кол-во ингредиентов в которых не больше 5.

### Работа с датами в `pandas`

2.1 Преобразуйте столбец `submitted` из таблицы `recipes` в формат времени. Модифицируйте решение задачи 1.1 так, чтобы считать столбец сразу в нужном формате.

2.2 Выведите информацию о рецептах, добавленных в датасет не позже 2010 года.

### Работа со строковыми данными в `pandas`

3.1  Добавьте в таблицу `recipes` столбец `description_length`, в котором хранится длина описания рецепта из столбца `description`.

3.2 Измените название каждого рецепта в таблице `recipes` таким образом, чтобы каждое слово в названии начиналось с прописной буквы.

3.3 Добавьте в таблицу `recipes` столбец `name_word_count`, в котором хранится количество слов из названии рецепта (считайте, что слова в названии разделяются только пробелами). Обратите внимание, что между словами может располагаться несколько пробелов подряд.

### Группировки таблиц `pd.DataFrame`

4.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

In [8]:
df_recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [17]:
df_recipes.groupby('contributor_id')['id'].agg(counted = 'count').sort_values(by = 'counted', ascending = False)

                counted
contributor_id
89831               421
37449               346
37779               345
1533                186
169430              183
...                 ...
245835                1
245653                1
245590                1
245378                1
2002247884            1

[8404 rows x 1 columns]

4.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы? Обратите внимание, что отзыв с нулевым рейтингом или не заполненным текстовым описанием не считается отсутствующим.

In [101]:
df_reviews.groupby('recipe_id')['rating'].agg('mean')
#Средний рейтинг по каждому рецепту

recipe_id
48        1.000000
55        4.750000
66        4.944444
91        4.750000
94        5.000000
            ...
536547    5.000000
536610    0.000000
536728    4.000000
536729    4.750000
536747    0.000000
Name: rating, Length: 28100, dtype: float64

In [90]:
df_reviews_no_nan= df_reviews[df_reviews.review.isna()!=True]

In [91]:
df_reviews_no_nan['len_description'] =df_reviews_no_nan['review'].str.split(' ').apply(len)

<ipython-input-91-0e7e12a214bd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_reviews_no_nan['len_description'] =df_reviews_no_nan['review'].str.split(' ').apply(len)

In [95]:
df_reviews_no_nan['len_description'].describe()

count    126679.000000
mean         53.615911
std          38.060417
min           1.000000
25%          28.000000
50%          46.000000
75%          69.000000
max         892.000000
Name: len_description, dtype: float64

In [98]:
no_review = df_recipes.shape[0] -df_recipes.id.isin(df_reviews_no_nan.recipe_id).sum()

In [100]:
print(f"Отсутствют отзывы у {no_review } ")

Отсутствют отзывы у 1900

4.3 Посчитайте количество рецептов с разбивкой по годам создания.

In [103]:
df_recipes['submitted']  = pd.to_datetime(df_recipes['submitted'],format = '%Y-%m-%d')

In [104]:
df_recipes.groupby(df_recipes['submitted'].dt.year)['id'].agg('count')

submitted
1999     275
2000     104
2001     589
2002    2644
2003    2334
2004    2153
2005    3130
2006    3473
2007    4429
2008    4029
2009    2963
2010    1538
2011     922
2012     659
2013     490
2014     139
2015      42
2016      24
2017      39
2018      24
Name: id, dtype: int64

### Объединение таблиц `pd.DataFrame`

5.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты, на которые не оставлен ни один отзыв, должны отсутствовать в полученной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и попытавшись найти строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [126]:
df_reviews[df_reviews['review'].isna()==True].head()

       Unnamed: 0     user_id  recipe_id        date  rating review
8881        56957  2001567544       9054  2017-06-03       5    NaN
12129      273481  2002120930     167202  2018-04-18       4    NaN
18578       56955  2001508809       9054  2017-04-26       5    NaN
21913      783599  2001959957     335709  2018-01-28       5    NaN
33232     1089381  2002299388      15553  2018-10-13       4    NaN

In [118]:
df_merged = df_recipes.merge(df_reviews_no_nan, left_on='id',right_on='recipe_id', how='inner')[['id','name','user_id','rating']]

In [125]:
df_merged.head()#Таблица

      id                                   name  user_id  rating
0  44123  george s at the cove  black bean soup   743566       5
1  44123  george s at the cove  black bean soup    76503       5
2  44123  george s at the cove  black bean soup    34206       5
3  67664     healthy for them  yogurt popsicles   494084       5
4  67664     healthy for them  yogurt popsicles   303445       5

In [124]:
df_merged[df_merged['user_id'] == 2001567544]#Подтверждение

Empty DataFrame
Columns: [id, name, user_id, rating]
Index: []

5.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`, где столбец `review_count` содержит кол-во отзывов, оставленных на рецепт `recipe_id`. У рецептов, на которые не оставлен ни один отзыв, в столбце `review_count` должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и найдя строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [158]:
df_reviews.head()

,Unnamed: 0,user_id,recipe_id,date,rating,review
0,370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
2,187037,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
3,706134,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
4,312179,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...

In [159]:
df_recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [160]:
df_merged_2 = df_recipes.merge(df_reviews, left_on='id',right_on='recipe_id', how='inner')[['recipe_id','name','review']]

In [161]:
df_merged_2.head()

,recipe_id,name,review
0,44123,george s at the cove black bean soup,I lived in San Diego for 19 years and would g...
1,44123,george s at the cove black bean soup,This soup is the Bomb! Don't hesitate to try.....
2,44123,george s at the cove black bean soup,I just can't say enough about how wonderful th...
3,67664,healthy for them yogurt popsicles,These are great! I use 100% (organic) juice a...
4,67664,healthy for them yogurt popsicles,"Very, very good. My son loves these. He like..."

In [162]:
df_merged_2_agg = df_merged_2.groupby('recipe_id')['review'].agg(review_count='count')

In [163]:
df_merged_2_agg.head()

           review_count
recipe_id
48                    2
55                    4
66                   18
91                    4
94                    4

In [164]:
df_merged_3 = df_merged_2.merge(df_merged_2_agg, on='recipe_id',how='left')[['recipe_id','name','review_count']]

In [165]:
df_merged_3.head()

   recipe_id                                   name  review_count
0      44123  george s at the cove  black bean soup             3
1      44123  george s at the cove  black bean soup             3
2      44123  george s at the cove  black bean soup             3
3      67664     healthy for them  yogurt popsicles             8
4      67664     healthy for them  yogurt popsicles             8

In [167]:
df_merged_3.review_count = df_merged_3.review_count.fillna(0)

In [170]:
df_merged_3.head()

   recipe_id                                   name  review_count
0      44123  george s at the cove  black bean soup             3
1      44123  george s at the cove  black bean soup             3
2      44123  george s at the cove  black bean soup             3
3      67664     healthy for them  yogurt popsicles             8
4      67664     healthy for them  yogurt popsicles             8

5.3. Выясните, рецепты, добавленные в каком году, имеют наименьший средний рейтинг?

In [172]:
df_merged_3 = df_recipes.merge(df_reviews, left_on='id',right_on='recipe_id', how='inner')[['date','rating']]

In [173]:
df_merged_3['date'] = pd.to_datetime(df_merged_3['date'],format = '%Y-%m-%d')

In [175]:
df_merged_3.groupby(df_merged_3['date'].dt.year)['rating'].agg(avg = 'mean').sort_values(by = 'avg',ascending = False)

           avg
date
2006  4.603673
2005  4.563680
2007  4.547077
2004  4.546548
2003  4.526940
2009  4.524728
2008  4.484635
2002  4.481556
2010  4.454440
2012  4.341427
2011  4.302045
2013  4.274168
2001  4.134426
2014  4.110595
2015  4.047145
2016  3.912603
2018  3.504076
2000  3.384615
2017  3.353042

### Сохранение таблиц `pd.DataFrame`

6.1 Отсортируйте таблицу в порядке убывания величины столбца `name_word_count` и сохраните результаты выполнения заданий 3.1-3.3 в csv файл.

6.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 5.1 и 5.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 5.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 5.2.

In [176]:
with pd.ExcelWriter("6_2.xlsx") as writer:
    df_merged.to_excel(writer, sheet_name="Рецепты с оценками", index=False)  
    df_merged_3.to_excel(writer, sheet_name="Количество отзывов по рецептам", index=False)

#### [версия 2]
* Уточнены формулировки задач 1.1, 3.3, 4.2, 5.1, 5.2, 5.3